Documents/Requests/Soap_Getcustomerdetails_DSL_mo_24_02_2022_05_40_45_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                 <ID>730575c5-996a-4254-9caf-28278137b506</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>594d991a-40a8-44ac-9e03-e5291a8b3e09</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T06:01:37.274Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>FN_</GlobalID>
                    <Mode>2</Mode>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>